grevaillot/svd_tools/headers/STM32G474xx/hrtim_timc.h
/** HRTIM_TIMC_TIMCDIER_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMC_TIMCDIER_DLYPRTDE		(1 << 30)
/** HRTIM_TIMC_TIMCDIER_RSTDE RSTDE **/
#define HRTIM_TIMC_TIMCDIER_RSTDE		(1 << 29)
/** HRTIM_TIMC_TIMCDIER_RSTx2DE RSTx2DE **/
#define HRTIM_TIMC_TIMCDIER_RSTx2DE		(1 << 28)
/** HRTIM_TIMC_TIMCDIER_SETx2DE SETx2DE **/
#define HRTIM_TIMC_TIMCDIER_SETx2DE		(1 << 27)
/** HRTIM_TIMC_TIMCDIER_RSTx1DE RSTx1DE **/
#define HRTIM_TIMC_TIMCDIER_RSTx1DE		(1 << 26)
/** HRTIM_TIMC_TIMCDIER_SET1xDE SET1xDE **/
#define HRTIM_TIMC_TIMCDIER_SET1xDE		(1 << 25)
/** HRTIM_TIMC_TIMCDIER_CPT2DE CPT2DE **/
#define HRTIM_TIMC_TIMCDIER_CPT2DE		(1 << 24)
/** HRTIM_TIMC_TIMCDIER_CPT1DE CPT1DE **/
#define HRTIM_TIMC_TIMCDIER_CPT1DE		(1 << 23)
/** HRTIM_TIMC_TIMCDIER_UPDDE UPDDE **/
#define HRTIM_TIMC_TIMCDIER_UPDDE		(1 << 22)
/** HRTIM_TIMC_TIMCDIER_REPDE REPDE **/
#define HRTIM_TIMC_TIMCDIER_REPDE		(1 << 20)
/** HRTIM_TIMC_TIMCDIER_CMP4DE CMP4DE **/
#define HRTIM_TIMC_TIMCDIER_CMP4DE		(1 << 19)
/** HRTIM_TIMC_TIMCDIER_CMP3DE CMP3DE **/
#define HRTIM_TIMC_TIMCDIER_CMP3DE		(1 << 18)
/** HRTIM_TIMC_TIMCDIER_CMP2DE CMP2DE **/
#define HRTIM_TIMC_TIMCDIER_CMP2DE		(1 << 17)
/** HRTIM_TIMC_TIMCDIER_CMP1DE CMP1DE **/
#define HRTIM_TIMC_TIMCDIER_CMP1DE		(1 << 16)
/** HRTIM_TIMC_TIMCDIER_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMC_TIMCDIER_DLYPRTIE		(1 << 14)
/** HRTIM_TIMC_TIMCDIER_RSTIE RSTIE **/
#define HRTIM_TIMC_TIMCDIER_RSTIE		(1 << 13)
/** HRTIM_TIMC_TIMCDIER_RSTx2IE RSTx2IE **/
#define HRTIM_TIMC_TIMCDIER_RSTx2IE		(1 << 12)
/** HRTIM_TIMC_TIMCDIER_SETx2IE SETx2IE **/
#define HRTIM_TIMC_TIMCDIER_SETx2IE		(1 << 11)
/** HRTIM_TIMC_TIMCDIER_RSTx1IE RSTx1IE **/
#define HRTIM_TIMC_TIMCDIER_RSTx1IE		(1 << 10)
/** HRTIM_TIMC_TIMCDIER_SET1xIE SET1xIE **/
#define HRTIM_TIMC_TIMCDIER_SET1xIE		(1 << 9)
/** HRTIM_TIMC_TIMCDIER_CPT2IE CPT2IE **/
#define HRTIM_TIMC_TIMCDIER_CPT2IE		(1 << 8)
/** HRTIM_TIMC_TIMCDIER_CPT1IE CPT1IE **/
#define HRTIM_TIMC_TIMCDIER_CPT1IE		(1 << 7)
/** HRTIM_TIMC_TIMCDIER_UPDIE UPDIE **/
#define HRTIM_TIMC_TIMCDIER_UPDIE		(1 << 6)
/** HRTIM_TIMC_TIMCDIER_REPIE REPIE **/
#define HRTIM_TIMC_TIMCDIER_REPIE		(1 << 4)
/** HRTIM_TIMC_TIMCDIER_CMP4IE CMP4IE **/
#define HRTIM_TIMC_TIMCDIER_CMP4IE		(1 << 3)
/** HRTIM_TIMC_TIMCDIER_CMP3IE CMP3IE **/
#define HRTIM_TIMC_TIMCDIER_CMP3IE		(1 << 2)
/** HRTIM_TIMC_TIMCDIER_CMP2IE CMP2IE **/
#define HRTIM_TIMC_TIMCDIER_CMP2IE		(1 << 1)
/** HRTIM_TIMC_TIMCDIER_CMP1IE CMP1IE **/
#define HRTIM_TIMC_TIMCDIER_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timc_cntcr CNTCR Timerx Counter Register
@{*/


#define HRTIM_TIMC_CNTCR_CNTx_SHIFT		0
#define HRTIM_TIMC_CNTCR_CNTx_MASK		0xffff
/** @defgroup hrtim_timc_cntcr_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_percr PERCR Timerx Period Register
@{*/


#define HRTIM_TIMC_PERCR_PERx_SHIFT		0
#define HRTIM_TIMC_PERCR_PERx_MASK		0xffff
/** @defgroup hrtim_timc_percr_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_repcr REPCR Timerx Repetition Register
@{*/


#define HRTIM_TIMC_REPCR_REPx_SHIFT		0
#define HRTIM_TIMC_REPCR_REPx_MASK		0xff
/** @defgroup hrtim_timc_repcr_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp1cr CMP1CR Timerx Compare 1 Register
@{*/


#define HRTIM_TIMC_CMP1CR_CMP1x_SHIFT		0
#define HRTIM_TIMC_CMP1CR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timc_cmp1cr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp1ccr CMP1CCR Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIMC_CMP1CCR_REPx_SHIFT		16
#define HRTIM_TIMC_CMP1CCR_REPx_MASK		0xff
/** @defgroup hrtim_timc_cmp1ccr_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIMC_CMP1CCR_CMP1x_SHIFT		0
#define HRTIM_TIMC_CMP1CCR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timc_cmp1ccr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp2cr CMP2CR Timerx Compare 2 Register
@{*/


#define HRTIM_TIMC_CMP2CR_CMP2x_SHIFT		0
#define HRTIM_TIMC_CMP2CR_CMP2x_MASK		0xffff
/** @defgroup hrtim_timc_cmp2cr_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp3cr CMP3CR Timerx Compare 3 Register
@{*/


#define HRTIM_TIMC_CMP3CR_CMP3x_SHIFT		0
#define HRTIM_TIMC_CMP3CR_CMP3x_MASK		0xffff
/** @defgroup hrtim_timc_cmp3cr_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp4cr CMP4CR Timerx Compare 4 Register
@{*/


#define HRTIM_TIMC_CMP4CR_CMP4x_SHIFT		0
#define HRTIM_TIMC_CMP4CR_CMP4x_MASK		0xffff
/** @defgroup hrtim_timc_cmp4cr_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cpt1cr CPT1CR Timerx Capture 1 Register
@{*/

/** HRTIM_TIMC_CPT1CR_DIR Timerx Capture 1 Direction status **/
#define HRTIM_TIMC_CPT1CR_DIR		(1 << 16)

#define HRTIM_TIMC_CPT1CR_CPT1x_SHIFT		0
#define HRTIM_TIMC_CPT1CR_CPT1x_MASK		0xffff
/** @defgroup hrtim_timc_cpt1cr_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cpt2cr CPT2CR Timerx Capture 2 Register
@{*/

/** HRTIM_TIMC_CPT2CR_DIR Timerx Capture 1 Direction status **/
#define HRTIM_TIMC_CPT2CR_DIR		(1 << 16)

#define HRTIM_TIMC_CPT2CR_CPT2x_SHIFT		0
#define HRTIM_TIMC_CPT2CR_CPT2x_MASK		0xffff
/** @defgroup hrtim_timc_cpt2cr_cpt2x CPT2x Timerx Capture 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_dtcr DTCR Timerx Deadtime Register
@{*/

/** HRTIM_TIMC_DTCR_DTFLKx Deadtime Falling Lock **/
#define HRTIM_TIMC_DTCR_DTFLKx		(1 << 31)
/** HRTIM_TIMC_DTCR_DTFSLKx Deadtime Falling Sign Lock **/
#define HRTIM_TIMC_DTCR_DTFSLKx		(1 << 30)
/** HRTIM_TIMC_DTCR_SDTFx Sign Deadtime Falling value **/
#define HRTIM_TIMC_DTCR_SDTFx		(1 << 25)

#define HRTIM_TIMC_DTCR_DTFx_SHIFT		16
#define HRTIM_TIMC_DTCR_DTFx_MASK		0x1ff
/** @defgroup hrtim_timc_dtcr_dtfx DTFx Deadtime Falling value
@{*/
/**@}*/

/** HRTIM_TIMC_DTCR_DTRLKx Deadtime Rising Lock **/
#define HRTIM_TIMC_DTCR_DTRLKx		(1 << 15)
/** HRTIM_TIMC_DTCR_DTRSLKx Deadtime Rising Sign Lock **/
#define HRTIM_TIMC_DTCR_DTRSLKx		(1 << 14)

#define HRTIM_TIMC_DTCR_DTPRSC_SHIFT		10
#define HRTIM_TIMC_DTCR_DTPRSC_MASK		0x07
/** @defgroup hrtim_timc_dtcr_dtprsc DTPRSC Deadtime Prescaler
@{*/
/**@}*/

/** HRTIM_TIMC_DTCR_SDTRx Sign Deadtime Rising value **/
#define HRTIM_TIMC_DTCR_SDTRx		(1 << 9)

